app/views/collaborators/index.html.erb

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        <td>
          <%= Library.all.find(collaborator.library_id).number %>
          <%= Library.all.find(collaborator.library_id).name %>