app/views/deliveries/_form.html.erb

SELECT "books".* FROM "books"
---
    <div class="col-sm-10">
       <%= form.select :book_id, options_for_select(Book.all.collect{ |s| [s.TitleOfTheBook+', '+s.author, s.id]}), {}, {class: "form-control form-control-lg"}  %>

SELECT "subscribers".* FROM "subscribers"
---
    <div class="col-sm-10">
     <%= form.select :subscriber_id, options_for_select(Subscriber.all.collect{ |s| [s.surname+' '+s.name+' '+s.patronymic,s.id]}), {}, {class: "form-control form-control-lg"}  %>