app/views/deliveries/index.html.erb

        <td>
           <%= Book.all.find(delivery.book_id).TitleOfTheBook %>,
          <%= Book.all.find(delivery.book_id).author %>
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

        <td>
          <%= Subscriber.all.find(delivery.subscriber_id).surname %>
            <%= Subscriber.all.find(delivery.subscriber_id).name %>, билет:
            <%= Subscriber.all.find(delivery.subscriber_id).ticket %>
---
SELECT  "subscribers".* FROM "subscribers" WHERE "subscribers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "subscribers".* FROM "subscribers" WHERE "subscribers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]