app/views/home/index.html.erb


<% books=Book.joins(:library, :deliveries) %>
---
SELECT "books".* FROM "books" INNER JOIN "libraries" ON "libraries"."id" = "books"."library_id" INNER JOIN "deliveries" ON "deliveries"."book_id" = "books"."id" ORDER BY "book_id" DESC


<%=Library.includes(:book, :deliveries).where(library:{id: 1}) do |s|%>
---
SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
SELECT "books".* FROM "books" INNER JOIN "libraries" ON "libraries"."id" = "books"."library_id" INNER JOIN "deliveries" ON "deliveries"."book_id" = "books"."id" WHERE (book_id = ?)