app/views/home/index.html.erb

SELECT  "libraries".* FROM "libraries" ORDER BY "libraries"."id" ASC LIMIT $1  [["LIMIT", 1000]]
---
  <tbody>
   <% Library.find_each do |library| %>

SELECT "books".* FROM "books" WHERE "books"."library_id" = $1  [["library_id", 1]]
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "books"
---
            <td><%= library.name %></td>
            <% Book.where("library_id = '1'") %>
            <td><%= Book.count%> </td>