app/views/books/index.html.erb

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
        <td>
            <%= Library.all.find(book.library_id).number %>
            <%= Library.all.find(book.library_id).name %>