app/views/subscribers/_form.html.erb

    <div class="col-sm-10">
      <%= form.select :library_id, options_for_select(Library.all.collect{ |s| [s.number+' '+s.name, s.id]}), {}, {class: "form-control form-control-lg"}  %>
---
SELECT "libraries".* FROM "libraries"