app/controllers/books_controller.rb

SELECT  "books".* FROM "books" ORDER BY "books"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
        def index
            @books = Book.all

SELECT "libraries".* FROM "libraries"
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        def edit
            @libraries = Library.all
            @book = Book.find(params[:id])

INSERT INTO "books" ("TitleOfTheBook", "author", "cipher", "publishing_house", "TheYearOfPublishing", "price", "receipt_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "books" ("library_id", "TitleOfTheBook", "author", "cipher", "publishing_house", "TheYearOfPublishing", "price", "receipt_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
        def create
            @book = Book.create(book_params)
            if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "author" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["author", "Ф.М.Достоевский"], ["updated_at", "2019-07-14 17:42:02.975186"], ["id", 1]]
---
        def update
            @book = Book.find(params[:id])

            if @book.update(book_params)