app/controllers/collaborators_controller.rb

SELECT "collaborators".* FROM "collaborators"
---
        def index
            @collaborators = Collaborator.all

SELECT  "collaborators".* FROM "collaborators" WHERE "collaborators"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        def show
            @collaborator = Collaborator.find(params[:id])

SELECT "libraries".* FROM "libraries"
---
        def new
            @libraries = Library.all

SELECT "libraries".* FROM "libraries"
SELECT  "collaborators".* FROM "collaborators" WHERE "collaborators"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        def edit
            @libraries = Library.all
            @collaborator = Collaborator.find(params[:id])

SELECT "libraries".* FROM "libraries"
INSERT INTO "collaborators" ("library_id", "name", "surname", "patronymic", "birthday", "date_of_employment", "post", "education", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
        def create
            @libraries = Library.all
            @collaborator = Collaborator.new(collaborator_params)
            if @collaborator.save

SELECT  "collaborators".* FROM "collaborators" WHERE "collaborators"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "collaborators" SET "surname" = $1, "name" = $2, "patronymic" = $3, "birthday" = $4, "date_of_employment" = $5, "post" = $6, "education" = $7, "updated_at" = $8 WHERE "collaborators"."id" = $9
---
        def update
            @collaborator = Collaborator.find(params[:id])

            if @collaborator.update(collaborator_params)