app/controllers/deliveries_controller.rb

        def index
            @deliveries = Delivery.all
---
SELECT "deliveries".* FROM "deliveries"

        def show
            @delivery = Delivery.find(params[:id])
---
SELECT  "deliveries".* FROM "deliveries" WHERE "deliveries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

        def edit
            @delivery = Delivery.find(params[:id])
---
SELECT  "deliveries".* FROM "deliveries" WHERE "deliveries"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

        def create
            @delivery = Delivery.new(delivery_params)
            if @delivery.save
---
INSERT INTO "deliveries" ("book_id", "subscriber_id", "date_delivery", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["book_id", 1], ["subscriber_id", 1], ["date_delivery", "1195-01-25"], ["created_at", "2019-07-14 12:46:45.008068"], ["updated_at", "2019-07-14 12:46:45.008068"]]

        def update
            @delivery = Delivery.find(params[:id])

            if @delivery.update(delivery_params)
---
SELECT  "deliveries".* FROM "deliveries" WHERE "deliveries"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "deliveries" SET "book_id" = $1, "subscriber_id" = $2, "updated_at" = $3 WHERE "deliveries"."id" = $4  [["book_id", 1], ["subscriber_id", 2], ["updated_at", "2019-07-14 19:48:43.921730"], ["id", 2]]

        def destroy
            @delivery = Delivery.find(params[:id])
            @delivery.destroy
---
SELECT  "deliveries".* FROM "deliveries" WHERE "deliveries"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "deliveries" WHERE "deliveries"."id" = $1  [["id", 2]]