app/controllers/home_controller.rb

  def index
    @books = Delivery.where("book_id = '1'").count
---
SELECT COUNT(*) FROM "deliveries" WHERE (book_id = '1')