app/controllers/libraries_controller.rb

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @library = Library.find(params[:id])

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @library = Library.find(params[:id])

INSERT INTO "libraries" ("number", "name", "adress", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["number", "1"], ["name", "sdfsdf"], ["adress", "sdfsd"], ["created_at", "2019-07-12 19:19:42.136679"], ["updated_at", "2019-07-12 19:19:42.136679"]]
INSERT INTO "libraries" ("number", "name", "adress", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["number", "1"], ["name", "dffg"], ["adress", "dfg"], ["created_at", "2019-07-09 21:49:03.375964"], ["updated_at", "2019-07-09 21:49:03.375964"]]
---
    def create
        @library = Library.new(library_params)

        # @library = Library.find(params[:article_id])
        @book = @library.books.create(comment_params)
        if @library.save

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "libraries" SET "number" = $1, "name" = $2, "adress" = $3, "updated_at" = $4 WHERE "libraries"."id" = $5  [["number", "4"], ["name", "им.Чехова"], ["adress", "ул. Попова, д.18"], ["updated_at", "2019-07-13 09:59:14.407615"], ["id", 1]]
---
    def update
        @library = Library.find(params[:id])

        if @library.update(library_params)

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "libraries" WHERE "libraries"."id" = $1  [["id", 1]]
---
    def destroy
        @library = Library.find(params[:id])
        @library.destroy