app/controllers/subscribers_controller.rb

SELECT "subscribers".* FROM "subscribers"
---
        def index
            @subscribers = Subscriber.all

SELECT  "subscribers".* FROM "subscribers" WHERE "subscribers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        def show
            @subscriber = Subscriber.find(params[:id])

SELECT "libraries".* FROM "libraries"
---
        def new
            @libraries = Library.all

SELECT "libraries".* FROM "libraries"
SELECT  "subscribers".* FROM "subscribers" WHERE "subscribers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        def edit
            @libraries = Library.all
            @subscriber = Subscriber.find(params[:id])

SELECT "libraries".* FROM "libraries"
INSERT INTO "subscribers" ("library_id", "ticket_number", "surname", "name", "patronymic", "adress", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
        def create
            @libraries = Library.all
            @subscriber = Subscriber.new(subscriber_params)
            if @subscriber.save

SELECT  "subscribers".* FROM "subscribers" WHERE "subscribers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subscribers" SET "library_id" = $1, "ticket_number" = $2, "surname" = $3, "name" = $4, "patronymic" = $5, "adress" = $6, "updated_at" = $7 WHERE "subscribers"."id" = $8
---
        def update
            @subscriber = Subscriber.find(params[:id])
            if @subscriber.update(subscriber_params)

SELECT  "subscribers".* FROM "subscribers" WHERE "subscribers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "subscribers" WHERE "subscribers"."id" = $1  [["id", 1]]
---
        def destroy
            @subscriber = Subscriber.find(params[:id])
            @subscriber.destroy